{"name":"Applesauce Cake","type":"dessert","ingredients":["2½ cups all-purpose flour (300g)","1½ cups granulated sugar (300g)","½ cup packed brown sugar (110g)","2 teaspoons baking powder","½ teaspoon baking soda","2 teaspoons ground cinnamon","2 teaspoons ground ginger","½ teaspoon ground all-spice","½ teaspoon salt","1 cup chopped walnuts (115g)","2 cups applesauce (480ml/560g)","½ cup coconut oil (120ml)","3 large eggs","2 teaspoons vanilla extract","For the frosting:","½ cup unsalted butter softened 113g","3 cups confectioners’ sugar (360g)","2 tablespoons milk","1 teaspoon vanilla extract"],"steps":["Preheat the oven to 350F. Grease a 13x9–inch baking pan with butter or baking spray and line with parchment paper.","In a large mixing bowl, whisk together the flour, sugars, baking powder, baking soda, cinnamon, ginger, all-spice, and salt. Stir in the walnuts.","In another medium mixing bowl, whisk together the applesauce, oil, eggs, and vanilla extract until well combined. Add the wet mixture to the dry mixture stirring just until combined. Pour into the prepared pan.","Bake for 40 to 45 minutes or until a toothpick inserted into the center comes out with a few moist crumbs. Let cool completely in the pan on a wire rack. Remove the cooled cake from the pan, discarding the parchment paper and place on a serving platter.","For the Frosting:","In a large mixing bowl, beat the butter on medium speed until creamy. Gradually add the sugar alternating with the milk until combined. Add the vanilla and beat until fluffy, adding additional milk if needed for a spreadable consistency.","Spread the frosting over the top of the cake. Garnish with walnuts if desired."],"story":"Hoyt Family Recipe\nA scale to measure your flour is highly recommended for the most accurate results.\nHowever, if you don’t have a scale, fluff your flour with a spoon and then spoon it\ninto your cups before leveling it off with a knife. This method is the best way to\nmeasure flour without overpacking the measuring cup, leading to a heavy\napplesauce cake.\n Lining the cake pan will help prevent the bottom of the cake from getting too dark.\nIt’ll also make lifting the cake out of the pan much easier.\n Tap the cake pan on the counter a few times to pop any air bubbles and level out\nthe batter in the pan for an even bake.\n Do not overmix the batter, or you’ll have a tough cake. Mix everything until just\ncombined, and avoid using a mixer.\n Room temperature eggs incorporate evenly and quickly so you do not overmix the\nbatter. If you forgot to bring the eggs out, put the cold eggs in a large bowl and\ncover them with warm tap water for 5 minutes.\n Make sure you allow the cake to cool fully before you frost it. If it is still warm, the\nfrosting may melt off."}