{"name":"Scones-Vicky Geilman","ingredients":[{"quantity":"2 3/4 c.","name":"King Arthur Unbleached All Purpose Flour","type":""},{"quantity":"1/3 c.","name":"granulated sugar","type":""},{"quantity":"3/4 tsp","name":"salt","type":""},{"quantity":"1 Tbsp","name":"baking powder","type":""},{"quantity":"8 Tbsp","name":"unsalted butter","type":""},{"quantity":"1 c.-2 c.","name":"chopped dried fruit, chocolate or other flavored chips, nuts, jammy bits or combination","type":""},{"quantity":"2 large","name":"eggs","type":""},{"quantity":"2 tsp","name":"vanilla","type":""},{"quantity":"3/4 c.","name":"half and half or milk","type":""},{"quantity":"2 tsp","name":"milk","type":""},{"quantity":"2 Tbsp","name":"coarse sparkling sugar or cinnamon sugar","type":""}],"steps":["In a large mixing bowl, whisk together the flour, sugar, salt and baking powder.","Work in the butter just until mixture is unevenly crumbly; it's ok for some larger chunks of butter to remain unincorporated.","Stir in the fruit, chips and/or nuts, if you're using them.","In a separate mixing bowl, whisk together the eggs, vanilla or other flavor, and half and half or milk. Add the liquid ingredients to the dry ingredients.","Use a bowl scraper or a large spoon, stir the dough ingredients until it is all moistened and holds together.","Line a baking sheet with parchment. Sprinkle a bit of flour atop parchment or pan.","Scrap the dough onto the floured parchment or pan, and divide it in half. Round each half into a 5 in circle. The circles should be about 3/4 in thick. Vicky doesn't do this she just scoops them onto the parchment covered pan. Using a knife or bench knife that you run under cold water, slice each circle into 6 wedges.","Brush each circle with milk and sprinkle coarse sugar  or cinnamon sugar on top.","Carefully pull the wedges away from the center to separate them just a bit; there should be about 1/2\" space between them, at their outer edges.","For best texture and highest rise, place the pan of scones in the freezer for 30 min, uncovered. Chilling the scones relaxes the gluten in the flour, which  makes the scones more tender and allows them to rise higher. It also chills the fat, which will make the scones a bit flakier. While the scones are chilling, preheat the oven to 425 F with a rack in the upper third.","Bake the scones in the upper part of your oven for 18-23 minutes or until they are a light brown. When you pull one away from the others, it should look baked all the way through, the edge shouldn't look wet or unbaked.","Remove the scones from the oven, and cool briefly on the pan. Serve warm. They are delicious as is, but add butter or jam if you like.","When the scones are completely cooled, wrap them in plastic and store at room temperature for up to several days. To reheat room temperature scones, place on baking sheet tent lightly with foil, and warm in a preheated oven 350 for 10 minutes.","*Tips Why the range of milk. Flour is like sponge it absorbs liquid during humid weather, and dries it out in the dry weather. In summer or when it's hot and humid, use the lesser amount of milk in this recipe; during winter or when it's dry use the greater amount. Either way, start with the smaller amount, and drizzle it in until the dough is the correct consistency.","*Tips Want to make the scones ahead of time? Simple. After the unbaked scones 30 min in the freezer (or whenever they are frozen solid) place them in a zip lock bag. Return to the freezer and store for up to a month. Bake as directed (without thawing) adding a couple extra minutes in oven if needed. "],"timers":["","","","","","","","","","","","","","",""]}