{"name":"Easy Sourdough Bearclaws","type":"dessert","ingredients":["Dough:","1/2 cup active sourdough starter (fed & bubbly)","1/2 cup warm milk","1/4 cup granulated sugar","1 large egg","2 3/4 cup all-purpose flour","1/2 tsp salt","1 tsp vanilla extract","4 tbsp unsalted butter, softened","Egg Wash:","1 egg yolk","1 tbsp milk","Almond filling:","1 cup blanched almonds","1 egg white","1/2 tsp almond extract","1 tbsp unsalted butter, softened","1 tbsp honey","1 tsp almond extract","1/2 cup powdered sugar","Glaze:","1/2 cup powdered sugar","1-2 tbsp heavy cream","1/2 tsp almond extract"],"steps":["Step 1: Make the dough:","Mix Wet Ingredients – In a bowl, whisk together the sourdough starter, warm milk, sugar, egg, and vanilla. Combine with Dry Ingredients – Add flour and salt, then mix until a shaggy dough forms. Knead – Add softened butter and knead until smooth and elastic (about 5–7 minutes). First Rise – Cover and let rise at room temperature for 4–6 hours, or until doubled. (You can also refrigerate overnight for better flavor.)","Step 2: Prepare the Almond Filling Blend Almonds – Process almonds until finely ground. Mix Ingredients – Add powdered sugar, egg white, almond extract, and melted butter. Blend until smooth.","Step 3: Shape the Bear Claws","Roll Out Dough – Lightly flour a surface and roll the dough to ¼-inch thickness. Cut & Fill – Cut into 4” x 2” rectangles. Spread almond filling over half of each piece. Fold & Shape – Fold the dough over the filling, press lightly, then make 3–4 small cuts on one side and slightly fan them out. Final Proof – Cover and let rise at room temperature for 1–2 hours, until puffy.","Preheat oven to 375 degrees. Brush with egg wash by mixing egg yolk and milk","Bake for 16-18 minutes until golden brown","Mix glaze & drizzle over the warm bear claws, let sit before serving","Optional: dust the bearclaws with powdered sugar"],"story":"To blanch almonds, just place in boiling water for 30-60 seconds then strain and place in ice water. Then peel skins"}