{"name": "Chicken Cacciatore", "type": "imported from pdf", "story": "Mary Waters", "ingredients": ["1 pound Pasta Or Egg Noodles 12 ounces, weight Mushrooms (﴾white Or Crimini)﴿, Sliced", "8 whole Chicken Thighs, Skin On ½ teaspoons Ground Thyme", "4 Tablespoons Olive Oil Red Pepper Flakes, Crushed, To Taste (﴾optional)﴿", "2 Tablespoons Butter ¾ cups Dry White Wine", "1 whole Medium Onion, Halved And Sliced 1 can (﴾28 Ounce)﴿ Whole Or Diced Tomatoes (﴾with Their Juice)﴿", "2 whole Red Bell Peppers, Cored And Sliced Chopped Flat Leaf Parsley", "2 whole Green Bell Peppers, Cored And Sliced Parmesan Cheese, For Sprinkling", "5 cloves Garlic, Diced"], "steps": ["Salt And Freshly Ground Black Pepper, To Taste ¼ teaspoons Turmeric", "½ cups All-‐purpose Flour ½ teaspoons Kosher Salt", "Preheat oven to 350 degrees (﴾F)﴿. Cook pasta according to package directions. Do not overcook! Drain and set aside.", "Salt and pepper both sides of the pieces of chicken. Dredge chicken in flour. Heat olive oil and butter in a heavy", "skillet or Dutch oven on the stovetop over medium-‐high heat. Place chicken skin down in pan, four pieces at a time.", "Brown chicken on both sides, then remove to a clean plate. Repeat with remaining chicken. Pour off half the fat in", "the pan and discard.Add sliced onions and peppers, as well as the garlic. Stir around for 1 minute. Add mushrooms and stir", "around for 1 minute. Add thyme, turmeric, and salt. (﴾And crushed red pepper flakes if you like things a little spicy.)﴿ Add extra", "black pepper to taste. Stir, then pour in wine. Allow to bubble.", "Pour in canned tomatoes and stir to combine. Add chicken back into the pan, skin side up, without totally", "submerging the chicken. Place lid on the pot and put it into the oven for 45 minutes. Remove lid and increase heat", "to 375 degrees. Cook for an additional 15 minutes. Remove pan from the oven. Remove chicken from the pot and place it on a", "plate. Remove vegetables from pot and plce them on a plate. Return pot to burner and turn heat to medium high. Cook and", "reduce sauce for a couple of minutes.", "Pour cooked, drained noodles on a large platter or in a big serving bowl. Add vegetables all over the top, then", "place chicken pieces on top of the vegetables. Spoon juices from the pot over the chicken and pasta.", "Before serving, sprinkle on chopped fresh parsley and grated Parmesan."]}