{"name": "Olive Garden Chicken Giardino", "type": "imported from pdf", "story": "Mary Waters", "ingredients": ["1 Tbsp. butter 1/4 cup water", "1/4 tsp. dry thyme 1/4 cup white wine", "1/2 tsp. fresh rosemary, finely chopped 1 Tbsp. milk", "1 tsp garlic pepper 1 tsp. lemon juice", "1 Tbsp. cornstarch Salt and pepper to taste/", "1/4 cup chicken broth", "2 lbs. boneless, skinless chicken breasted sliced in 1/2\" strips 1 clove garlic, finely minced", "1/4 cup extra-­‐virgin olive oil Juice of half of a lemon", "2 small rosemary sprigs", "1/4 cup extra-­‐virgin olive oil 1 cup broccoli florets, blanched", "1 zucchini, julienne cut 1/2 cup frozen peas,", "1 yellow summer squash, julienne cut 1cup spinach, cut in 1/2\" pieces", "2 roma tomatoes 1/2 carrots, julienne cut", "1/2 red bell pepper, julienne cut", "1/2 bunch fresh asparagus (remove bottom inch of stem; cut remainder into 1\" pieces", "1 lb. farfalle pasta (bow ties), cook according to package directions."], "steps": ["Sauce:", "Chicken:", "Vegtables:", "Sauce Preparation:", "Melt butter in a sauce pan over medium heat. Stir in thyme, garlic pepper and rosemary. Whisk to", "thoroughly blend and cook for 1 minute.", "Combine chicken broth, water, wine, milk, and lemon juice in a mixing bowl. Add cornstarch and whisk", "until cornstarch has dissolved and there are no lumps. Add liquid mixture to sauce pan. Whisk all ingredients together", "and bring to a boil. Season with salt and pepper to taste, then remove from heat.", "Chicken & Vegetables Preparation:", "Combine all chicken ingredients in a mixing bowl and blend well. Marinate for 30 minutes. Heat in a saute pan over", "medium high heat. Add 1/4 cup extra virgin olive oil. Saute chicken strips until internal temp. reaches 165. Add all", "vegtables and saute until cooked through. Add cooked, drained pasta and sauce to saute pan. Stir until pasta is", "thoroughly coated with sauce. Transfer to a serving platter and garnish with chopped parsley."]}