{"name": "PF CHANGS Mongolian Beef", "type": "imported from pdf", "story": "Rebecca Browning", "ingredients": ["2 tsp. veg. oil 3/4 c. dark brown sugar", "1/2 tsp. ginger, minced 1 c. veg. oil", "1 Tbsp. garlic, chopped 1 lb. flank steak", "1/2 c. soy sauce 1/4 c. cornstarch", "1/2 c. water 2 large green onions", "1. Make the sauce by heating 2 tsp. of veg. oil in a medium sauce pan over low/med heat.", "2. Don't get the oil to hot.", "3. Add ginger and garlic to the pan and quickly add the soy sauce and water before the garlic scorches.", "4. dissolve brown sugar in the sauce, then raise the heat to about medium and boil the sauce for 2-‐3 minutes", "5. Remove from heat.", "6. Slice the flank steak against the grain into a 1/4 in. thick bite size slices.", "7. Tilt the blade of your knife at about a 45 degree angle to the top of the steak so that the steak so that you", "8. Dip the steak pieces into the cornstarch to apply a very thin dusting to both sides of each piece of beef.", "9. Let the beef sit for about 10 min. so that the cornstarch sticks.", "10. As the beef sits, heat up one cup of oil in a wok (﴾you may use a skillet for this step as long as the beef is", "11. Heat the oil over medium heat until it is nice and hot, but not smoking.", "12. Add the beef to the oil and saute for just two minutes, or until the beef just begins to darken on the edges.", "13. You don't need a thorough cooking here since the beef is going back on the heat later.", "14. Stir the meat around a little so that it cooks evenly.", "15. After a couple of minutes, use a large slotted spoon to take the meat out onto paper towels, then pour the", "16. Put the pan back over the heat, dump the meat into the skillet for one minute.", "17. Add the sauce, cook for one more minute while stirring, then add the green onions.", "18. Cook for one more minute, then remove the beef and onions with tongs or slotted spoon to a serving plate.", "19. Leave excess sauce in pan (﴾use as much as desired)﴿"], "steps": ["until the sauce thickens.", "get wider cuts.", "mostly covered with oil.", "oil out of the wok or skillet."]}