{"name": "Prime Rib Roast with Roasted Garlic Thyme Sauce", "type": "imported from pdf", "story": "Robyn Christensen", "ingredients": ["7 to 8lb Prime Rib Roast 3 Tablespoons fresh thyme leaves-‐ chopped", "2 Tablespoon vegetable oil 1 1/2 cup dry red wine or red grape juice", "3 heads of garlic 2 Tablespoon red-‐ vinegar", "1/4 cup shallots or green onions-‐ chopped 1 bay leaf", "1. Preheat oven to 475 degrees", "2. Put roast, in center of 13 x 9 inch roasting pan or center of roaster and rub all over with 1 Tbsp of oil. Cut", "3. Roast beef in roaster or middle rack of oven for 30 min. Remove beef and with a bulb baster skim", "4. Reduce temperature to 375 degrees.", "5. Add foil wrapped garlic to oven or roaster, making sure foil doesn't touch meat. Roast beef with garlic", "75-‐90 minutes more, or until a meat thermometer inserted in to center of meat registers 115 degrees.", "6.While beef is standing, remove all but about 2 Tablespoon fat from pan (﴾ if you don't have a lot of fat butter is"], "steps": ["cut about 1/2 inch from tops of garlic heads to expose cloves and discard tops. Rub beef all over with", "cut side of 1 garlic head and sprinkle with 2 Tablespoons thyme, pressing to adhere. Slice slits all over roast and", "remove cloves from garlic head and cut each clove in half. Place sliced garlic cloves in slits all over roast. Season", "beef generously with salt and pepper. Put remaining 2 garlic heads on a double layer of foil and drizzle with", "remaining 1 Tablespoon of oil. Wrap garlic tightly in foil.", "all but about 1/2 cup fat from pan.", "Transfer garlic in foil to a rack and transfer beef to a platter, reserving pan juices. Let beef stand 25min (﴾meat", "will continue to cook, reaching about 130 degrees for medium-‐rare)﴿", "a yummy substitute)﴿. Add onions to pan on top of stove cook over moderate heat, stirring, 2min. Unwrap garlic,", "protecting your hand with a double paper towel squeeze roasted garlic into onion mixture and discard skins. Add", "vinegar, grape juice, bay leaf and remaining Tablespoon of thyme and boil mixture. Mashing garlic with wooden", "against bottom of pan, until reduced to about 1 cup. (﴾takes about 5 min)﴿. if you want more sauce then double", "the recipe. If sauce needs thickening take about 1Tablespoon corn starch and about 1/4 cup of cool water and", "stir until dissolved and then add that to the boiling sauce, you can add more or less depending on how thick", "you want your sauce."]}