{"name": "Strawberry Cream Puff Cake", "type": "imported from pdf", "story": "Naoma Wilkinson", "ingredients": ["5 tablespoons butter 4 ounces cream cheese, softened", "2/3 cup water 1 teaspoon fresh orange zest", "1 tablespoon sugar 1/2 teaspoon vanilla", "2/3 cup flour 1 cup heavy whipping cream", "3 eggs 2/3 cup powdered sugar"], "steps": ["Cream Puff Base: Cream Cheese Mixture:", "For the cream puff layer, preheat the oven to 375 degrees. Bring the butter, water and sugar to a boil in a medium", "saucepan. Add the flour all at once and stir quickly until the mixture pulls away from the sides of the pan. Remove", "the pan from the heat and stir the mixture until smooth. Let cool for 5 minutes. Add the eggs one at a time and beat", "until the mixture is shiny with a satiny sheen. Don't overbeat. Lightly grease the bottom and sides of a 9-­‐inch", "springform pan (or in a pinch, you could use a 9-­‐inch circle cake pan). Using an offset spatula, spread the mixture", "on the bottom and one inch up the sides of the prepared pan. Bake for 25 minutes. Remove from the oven and", "prick pastry with a toothpick 10-­‐12 times. Return to the oven and bake 5-­‐10 minutes more until golden brown but", "not overbaked (you can insert a toothpick into the center and if it comes out with sticky dough, it still needs", "longer in the oven). Cool completely.", "For the cream cheese mixture, beat the cream cheese until smooth. Gradually add the powdered sugar (if you want", "to ensure there are no lumps, sift the powdered sugar into the cream cheese) and beat with the cream cheese until", "mixture is smooth and light. Add the remaining ingredients and beat until stiff peaks form. Spread onto the cooled", "cream puff shell.", "Top with fresh sliced strawberries (I mixed 2 cups of strawberries with 1 teaspoon sugar and let them hang out in", "the fridge while I was prepping the cake) or you can use a 16-­‐ounce bag of frozen strawberries that have been", "thawed. Mix the thawed strawberries and juice with 1-­‐2 teaspoons sugar and bring to a simmer in a saucepan.", "Cook until slightly thickened. Cool completely and use as topping for the cake."]}